"""

Python কি (What is Python )?
Python একটি শক্তিশালী হাই-লেভেল অবজেক্ট-ওরিয়েন্টেড এবং ডায়নামিক কম্পিউটার  প্রোগ্রামিং ল্যাংগুয়েজ ।
যা ১৯৮০ সালে ডাচ প্রোগ্রামার গুইডো ভ্যান রাসম প্রথম ডিজাইন শুরু করেন এবং ১৯৯১ সালের ফেব্রুয়ারিতে প্রথম তিনি এটি প্রকাশ করেন।


মূলতঃ  ১৯৮০ দশকের পরে গুইডো ভ্যান রাসম যখন আমিবা ডিস্ট্রিবিউটেড অপারেটিং সিস্টেম গ্রূপ এর সাথে কাজ করছিলেন।
তখন তিনি ABC ( উল্লেখ্যঃ ABC একটি কম্পিউটার ল্যাংগুয়েজ যার সিনট্যাক্স খুবই সহজ এবং বোধগম্য)-এর মত ইন্টারপ্রেটেড
(Interpreted) ভাষা ব্যবহার করতে চাইলেন যা আমিবা সিস্টেম কলকে এক্সেস করতে পারবে। তাই তিনি নতুন একটি ভাষা তৈরির
দিদ্ধান্ত নিলেন যেটা হবে সমপ্রসারনযোগ্য । এটাকে কেন্দ্র করেই নতুন একটি ভাষার সূত্রপাত হলো এবং পরবর্তীতে এটার নাম রাখা হলো পাইথন।



Python নাম কেন?
মূলতঃ  সত্তরের দশকের পরে ভ্যান রাসম BBC এর “Monty Python’s Flying Circus”
কমেডি সিরিজের ভীষণ ভক্ত ছিলেন। আর এর সাথে সমঞ্জস্য রেখেই তিনি এটির নাম রাখেন পাইথন।



Python Programming Language দিয়ে কি করা যায় ?

পাইথন দিয়ে করা যায়না এমন কিছু খুজে পাওয়াই দুষ্কর, অর্থাৎ পাইথন দিয়ে যেকোন ধরনের অ্যাপ্লিকেশন তৈরিই সম্ভব।

বর্তমানে বহুল আলোচিত এবং ভবিষ্যতের প্রযুক্তির ভিত্তি ডাটা সায়েন্স এবং মেশিন লার্নিং, সর্বোপরি আর্টিফিশিয়াল ইন্টেলিজেন্স
নিয়ে কাজ করতে চাইলে পাইথন হতে পারে নির্দ্বিধায় আপনার প্রথম পছন্দের প্ল্যাটফর্ম।
কারণ, scikit-learn এর মত মেশিন লার্নিং লাইব্রেরী, Pandas এর মত ডাটা ফ্রেম লাইব্রেরী,
Numpy এর মত ক্যালকুলেশন লাইব্রেরী যেগুলো এক কথায় অনন্য- এসবই আছে পাইথনের জন্য।


আরও নির্দিষ্ট করে বলতে গেলে পাইথন এর উপর ভিত্তি করে
 – Django, Flask, Tornado ইত্যাদি ফ্রেমওয়ার্ক এর মাধ্যমে আপনি যেমন খুব সহজে ওয়েব অ্যাপ্লিকেশন ডেভেলপমেন্ট করতে পারবেন।

আবার ডেস্কটপ বা গ্রাফিক্যাল ইউজার ইন্টারফেইস সমৃদ্ধ সফটওয়্যার ডেভেলপমেন্টের জন্য পাইথন ল্যাঙ্গুয়েজ এর উপর ভিত্তি করে আপনার
জন্য আছে  PyQT এর মত টুলকিট বা Tkinter এর মত প্যাকেজ । আরও আছে Kivy এর মত লাইব্রেরী।

আর গেম ডেভেলপমেন্ট করতে চাইলে আপনার জন্য আছে PyGame.

আপনি যদি Internet of Things (IoT) নিয়ে কাজ করতে চান, তাহলে আপনার জন্য  আছে raspberrypi, বা RPi.GPIO.
এর মত হার্ডওয়্যার প্ল্যাটফর্ম।

বিভিন্ন সাইট যেমন-Mozilla, Reddit, Instagram, PBS, Dropbox, Google Search Engine ইত্যাদি ওয়েব এপ্লিকেশন পাইথন দিয়ে লেখা।


1. GUI ভিত্তিক সফটওয়্যার ডেভেলেপমেন্ট
    কোন সফটওয়্যার এর কথা মাথায় আসলেই আমাদের চোখে প্রথমেই ভেসে আসে একটি Graphical user interface বা GUI.
     সর্বসাধারণের ব্যবহার উপযোগী কোন সফটওয়্যার তৈরি করতে গেলে গ্র্যাফিক্যাল ইন্টারফেসের কোন বিকল্প নেই। সাধারণ ব্যবহারকারীরা
     কখনোই command line interface বা CLI ব্যবহার করে কোন সফটওয়্যার ব্যবয়ার করতে উৎসাহী হবে না।

     পাইথনে বেশ কিছু API এবং লাইব্রেরি আছে যার মাধ্যমে খুব সহজেই GUI অ্যাপ্লিকেশন ডেভেলপ করা যায়। এর জন্য বাড়তি কিছুর দরকার নেই,
     শুধু ঐ API বা লাইব্রেরির ফাংশন গুলো জানলেই হয়। নিচে কিছু জনপ্রিয় API এর তালিকা দেওয়া হল –

            Tkinter
            Kivy
            PyQT
            WxPython
            PySide
            PyGUI
            PyGTK ইত্যাদি

2. ওয়েব অ্যাপ্লিকেশন ডেভেলপমেন্ট (Web Application Development....
    বর্তমানে ওয়েব অ্যাপ্লিকেশন ডেভেলপ করার জন্য অধিকাংশই PHP ব্যবহার করে। কিন্তু এই কাজটা পাইথন ব্যবহার করেও করা যায়। পৃথিবীর
    বড় বড় কোম্পানি গুলোও এখন পাইথনের দিকে ঝুকেছে। পাইথনে বিভিন্ন ধরনের ওয়েব ফ্রেমওয়ার্ক আছে, যার মধ্যে জ্যাঙ্গো (Django)
     সবচেয়ে জনপ্রিয়। নিচে কিছু জনপ্রিয় ফ্রেমওয়ার্কের নাম উল্লেখ করা হল –

                Django
                Flask
                Pyramid
                Web2Py
                Bottle
                TurboGears
                CherryPy
                Dash
                Sanic ইত্যাদি।


3. সিস্টেম প্রোগ্রামিং (System Programming).......
    পাইথনের বিল্ট-ইন ইন্টারফেস দিয়ে সিস্টেম প্রোগ্রামিং এর মত জটিল কাজও করা যায়। থ্রেডিং (Threading),
    শেল কমান্ড (Shell command), ফাইল হ্যান্ডলিং (File Handling), ইত্যাদির মত জটিল কাজগুলোও পাইথনে খুব সহজেই করা যায়।

4. ডাটাবেজ প্রোগ্রামিং (Database Programming).......
    যুগোপযোগী ও ডাইনামিক (Dynamic) অ্যাপ্লিকেশন তৈরির জন্য ডাটাবেজের কোন বিকল্প নেই। আর তাই সকল জনপ্রিয় রিলেশনাল ডাটাবেজ সিস্টেম
     (Relational Database System) যেমন MySQL, Oracle, SQLite, ODBC, PostgreSQL ইত্যাদির জন্য পাইথনের ইন্টারফেস আছে,
    আর এই ইন্টারফেস ব্যবহার করে খুব সহজেই এগুলোকে হ্যান্ডল করা যায়।

    পাইথনে পোর্টেবল ডাটাবেজ (Portable Databse) API আছে যার মাধ্যমে ডাটাবেজগুলো্র কোন পরিবর্তন না করেই বিভিন্ন প্ল্যাটফর্মে ব্যবহার করা যায়।


5. সাইন্টিফিক প্রোগ্রামিং (Scientific Programming).....
        নিউমেরিক এবং সাইন্টিফিক প্রোগ্রামিং এর জন্য ম্যাটল্যাব এর কোন জুড়ি নেই। কিন্তু এই স্থানটি পাইথন খুব দ্রুতই দখল করে নিয়েছে। যেকোন
        ধরনের সাইন্টিফিক এবং নিউমেরিক গণনার জন্য পাইথনে আছে বিভিন্ন ধরনের লাইব্রেরি। নিচে কিছু জনপ্রিয় লাইব্রেরির নাম উল্লেখ করা হল –

        Numpy
        SciPy
        Pandas
        SymPy
        PIL
        Astropy
        ScientificPython ইত্যাদি

6. মেশিন লার্নিং ও ডিপ লার্নিং (Machine Leaning and Deep Learning)...........
    বেশ কয়েক বছর ধরেই কৃত্তিম বুদ্ধিমত্তা বা Artificial Intelligent এর জয়জয়কার অবস্থা। আর পাইথন নিজেও এই জয়ের সঙ্গী হয়েছে।
    বর্তমান সময়ে যতগুলো ভাল ভাল লাইব্রেরি, ফ্রেমওয়ার্ক বা API আছে তার সবগুলোতেই পইথনের সাপোর্ট রয়েছে। অর্থাৎ এই ফ্রেমওয়ার্কগুলো
    দিয়ে আপনি খুব সহজেই যেকোন ধরনের মডেল ডিজাইন করতে পারেন। গিটহাবেও আছে অসংখ্য কোড।
    নিচে কিছু কিছু API এবং ফ্রেমওয়ার্ক এর নাম উল্লেখ করা হল –

        TensorFlow
        Pytorch
        Keras
        MXNet
        Sonnet
        DL4J ইত্যাদি।
"""