"""
পাইথনে কাস্টিং তাই কনস্ট্রাক্টর ফাংশন ব্যবহার করে করা হয়:
int() - একটি পূর্ণসংখ্যা আক্ষরিক থেকে একটি পূর্ণসংখ্যা তৈরি করে, একটি ফ্লোট আক্ষরিক (সমস্ত দশমিক মুছে ফেলে),
 বা একটি স্ট্রিং আক্ষরিক (স্ট্রিংটি একটি সম্পূর্ণ সংখ্যার প্রতিনিধিত্ব করে)

float() - একটি পূর্ণসংখ্যা আক্ষরিক, একটি ফ্লোট আক্ষরিক বা একটি স্ট্রিং আক্ষরিক থেকে একটি ফ্লোট সংখ্যা তৈরি করে
(স্ট্রিংটি একটি ফ্লোট বা একটি পূর্ণসংখ্যার প্রতিনিধিত্ব করে)

str() - স্ট্রিং, ইন্টিজার লিটারেল এবং ফ্লোট লিটারেল সহ বিভিন্ন ধরণের ডেটা থেকে একটি স্ট্রিং তৈরি করে
"""
print("Python Casting----------------------\n")

a = int(10.40)
print("10.40 = Integer a = ",a)
print(type(a))


b = float(10)
print("\n10 = Floating b = ",b)
print(type(b))


c = str(100)
print("\n100 = String c = ",c)
print(type(c))


d = int("100")
print("\n100 = Integer d = ",d)
print(type(d))